package org.example.fundamental;

public class Operators {
    // Операторы - это специальные символы, выполняющие определенные операции над операндами и возвращающие результат.

    /* Приоритет операторов:
        - постфиксный (i++, i--);
        - унарный (++i, --i, +i, -i, ~ - инвертирует битовую комбинацию, ! - инвертирует логическое значение);
        - мультипликативный (*, /, %);
        - добавка (+, -);
        - сдвиг (<<, >>, >>>);
        - реляционный (<, >, <=, >=, instanceOf);
        - равенство (==, !=);
        - побитовое И (&);
        - побитовое исключение ИЛИ (^);
        - побитовое ИЛИ (|);
        - логическое И (&&);
        - логическое ИЛИ (||);
        - тернарный (? :);
        - присваивание (=, +=, -=, *=, /=, %=, &=, ^=, |=, <<=, >>=, >>>=).

      Важно:
        - инкремент/декремент ПОСТФИКСНЫЙ сначала возвращает значение, затем изменяет;
        - инкремент/декремент ПРЕФИКСНЫЙ сначала изменяет значение, затем возвращает;
        - оператор instanceOf проверяет: является ли объект экземпляром указанного в сравнении класса.

      Все операторы делятся на следующие группы:
        - присваивания (=)
        - арифметические (+, -, *, /, %)
        - унарные (+, -, ++, --, !)
        - равенства и отношения (==, !=, >, >=, <, <=)
        - условные (&&, ||, ?:)
        - сравнения типов (instanceOf)
        - побитовые (!, ~, >>, <<, >>>, &, |, ^)
    */
}
