package org.example.fundamental;

public class ProgramLifeCycle {
    /*
    Жизненный цикл программы на языке программирования Java выглядит следующим образом:
    1) Программист пишет код в IDE / редакторе кода - файлы ".java";
    2) Файлы ".java" компилируются "javac", содержащийся в JDK - файлы ".class";
    3) Загрузка классов из файлов ".class" ClassLoader'ом, содержащимся в JVM;
    4) Верификация байт-кода, до проверки JRE не доверяет JDK, так как не знает какой компилятор создал ".class" файл;
    5) JIT-компиляция в машинный код в JVM;
    6) Выполнение программы и сборка мусора;
    7) Завершение работы.

    JDK (Java Development Kit)
    JRE (Java Runtime Environment)
    JVM (Java Virtual Machine)
    JIT (Just-in-time)

    JVM обеспечивает совместимость с различными ОС.
    Данная архитектура делает код, соответствующим правилу: "напиши один раз, используй несколько".
     */
}
